ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G45x/N32G451.svd
</registers>

</peripheral>

<peripheral>
    <name>IWDG</name>
    <description>Independent watchdog</description>
    <groupName>IWDG</groupName>
    <baseAddress>0x40003000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
                <registers>
<register>
  <name>IWDG_KEY</name>
  <displayName>IWDG_KEY</displayName>
  <description>IWDG_KEY</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>KEYV</name>
      <description>KEYV</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>IWDG_PREDIV</name>
  <displayName>IWDG_PREDIV</displayName>
  <description>IWDG_PREDIV</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000007</resetMask>
  <fields>
    <field>
      <name>PD</name>
      <description>PD</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>IWDG_RELV</name>
  <displayName>IWDG_RELV</displayName>
  <description>IWDG_RELV</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000fff</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>REL</name>
      <description>REL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>IWDG_STS</name>
  <displayName>IWDG_STS</displayName>
  <description>IWDG_STS</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000003</resetMask>
  <fields>
    <field>
      <name>PVU</name>
      <description>PVU</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CRVU</name>
      <description>CRVU</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>

<peripheral>
    <name>PWR</name>
    <description>Power control</description>
    <groupName>PWR</groupName>
    <baseAddress>0x40007000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>PVD</name>
        <description>PVD through EXTI line detection interrupt</description>
        <value>1</value>
    </interrupt>
    <registers>
<register>
  <name>PWR_CTRL1</name>
  <displayName>PWR_CTRL1</displayName>
  <description>PWR_CTRL1</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000003ff</resetMask>
  <fields>
    <field>
      <name>__LPS</name>
      <description>__LPS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__PDS</name>
      <description>__PDS</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__CWKUP</name>
      <description>__CWKUP</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__CSBVBAT</name>
      <description>__CSBVBAT</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>__PVDEN</name>
      <description>__PVDEN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PRS</name>
      <description>PRS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>DBKP</name>
      <description>DBKP</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MSB</name>
      <description>MSB</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>PWR_CTRLSTS</name>
  <displayName>PWR_CTRLSTS</displayName>
  <description>PWR_CTRLSTS</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000010f</resetMask>
  <fields>
    <field>
      <name>WKUPF</name>
      <description>WKUPF</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SBF</name>
      <description>SBF</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PVDO</name>
      <description>PVDO</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VBATF</name>
      <description>VBATF</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WKUPEN</name>
      <description>WKUPEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>PWR_CTRL2</name>
  <displayName>PWR_CTRL2</displayName>
  <description>PWR_CTRL2</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x000006e4</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>__STOP2S</name>
      <description>__STOP2S</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR2VBRET</name>
      <description>SR2VBRET</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR2STBRET</name>
      <description>SR2STBRET</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TMPWPEN</name>
      <description>TMPWPEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSITRIM</name>
      <description>LSITRIM</description>
      <bitOffset>4</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>IWDGWPEN</name>
      <description>IWDGWPEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IWDGRSTEN</name>
      <description>IWDGRSTEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>PWR_CTRL3</name>
  <displayName>PWR_CTRL3</displayName>
  <description>PWR_CTRL3</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>EXMODE</name>
      <description>EXMODE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
