ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G45x/N32G451.svd
<register>
  <name>RCC_BDCTRL</name>
  <displayName>RCC_BDCTRL</displayName>
  <description>RCC_BDCTRL</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00018307</resetMask>
  <fields>
    <field>
      <name>LSEEN</name>
      <description>LSEEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSERDIF</name>
      <description>LSERDIF</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSEBP</name>
      <description>LSEBP</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RTCSEL</name>
      <description>RTCSEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>RTCEN</name>
      <description>RTCEN</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BDSFTRST</name>
      <description>BDSFTRST</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_CTRLSTS</name>
  <displayName>RCC_CTRLSTS</displayName>
  <description>RCC_CTRLSTS</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0c000003</resetValue>
  <resetMask>0xffb80003</resetMask>
  <fields>
    <field>
      <name>LSIEN</name>
      <description>LSIEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSIRD</name>
      <description>LSIRD</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BORRSTF</name>
      <description>BORRSTF</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RETEMCF</name>
      <description>RETEMCF</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BKPEMCF</name>
      <description>BKPEMCF</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RAMRSTF</name>
      <description>RAMRSTF</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RMRSTF</name>
      <description>RMRSTF</description>
      <bitOffset>24</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MMURSTF</name>
      <description>MMURSTF</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PINRSTF</name>
      <description>PINRSTF</description>
      <bitOffset>26</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PORRSTF</name>
      <description>PORRSTF</description>
      <bitOffset>27</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SFTRSTF</name>
      <description>SFTRSTF</description>
      <bitOffset>28</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IWDGRSTF</name>
      <description>IWDGRSTF</description>
      <bitOffset>29</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WWDGRSTF</name>
      <description>WWDGRSTF</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LPWRRSTF</name>
      <description>LPWRRSTF</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_AHBPRST</name>
  <displayName>RCC_AHBPRST</displayName>
  <description>RCC_AHBPRST</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0003fa00</resetMask>
  <fields>
    <field>
      <name>RNGCRST</name>
      <description>RNGCRST</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SACRST</name>
      <description>SACRST</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC1RST</name>
      <description>ADC1RST</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC2RST</name>
      <description>ADC2RST</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC3RST</name>
      <description>ADC3RST</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC4RST</name>
      <description>ADC4RST</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ETHMACRST</name>
      <description>ETHMACRST</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_CFG2</name>
  <displayName>RCC_CFG2</displayName>
  <description>RCC_CFG2</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00003800</resetValue>
  <resetMask>0x3f00fdff</resetMask>
  <fields>
    <field>
      <name>ADCHPRES</name>
      <description>ADCHPRES</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>ADCPLLPRES</name>
      <description>ADCPLLPRES</description>
      <bitOffset>4</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>ADC1MSEL</name>
      <description>ADC1MSEL</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC1MPRES</name>
      <description>ADC1MPRES</description>
      <bitOffset>11</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>RNGCPRES</name>
      <description>RNGCPRES</description>
      <bitOffset>24</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>TIMCLKSEL</name>
      <description>TIMCLKSEL</description>
      <bitOffset>29</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_CFG3</name>
  <displayName>RCC_CFG3</displayName>
  <description>RCC_CFG3</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00003840</resetValue>
  <resetMask>0x0006f840</resetMask>
  <fields>
    <field>
      <name>BORRSTEN</name>
      <description>BORRSTEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TRNG1MPRES</name>
      <description>TRNG1MPRES</description>
      <bitOffset>11</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>TRNG1MSEL</name>
      <description>TRNG1MSEL</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TRNG1MEN</name>
      <description>TRNG1MEN</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
