ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G45x/N32G451.svd
</registers>

</peripheral>

<peripheral>
    <name>SDIO</name>
    <description>Secure digital input/output interface</description>
    <groupName>SDIO</groupName>
    <baseAddress>0x40018000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>SDIO</name>
        <description>SDIO global interrupt</description>
        <value>49</value>
    </interrupt>
    <registers>
<register>
  <name>SDIO_PWRCTRL</name>
  <displayName>SDIO_PWRCTRL</displayName>
  <description>SDIO_PWRCTRL</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000003</resetMask>
  <fields>
    <field>
      <name>PWRCTRL</name>
      <description>PWRCTRL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_CLKCTRL</name>
  <displayName>SDIO_CLKCTRL</displayName>
  <description>SDIO_CLKCTRL</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DIV</name>
      <description>DIV</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>CLOCKEN</name>
      <description>CLOCKEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PWRCFG</name>
      <description>PWRCFG</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLKBYP</name>
      <description>CLKBYP</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BUSMODE</name>
      <description>BUSMODE</description>
      <bitOffset>11</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>CLKEDGE</name>
      <description>CLKEDGE</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HWCLKEN</name>
      <description>HWCLKEN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIV_8</name>
      <description>DIV_8</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_CMDARG</name>
  <displayName>SDIO_CMDARG</displayName>
  <description>SDIO_CMDARG</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CMDARG</name>
      <description>CMDARG</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_CMDCTRL</name>
  <displayName>SDIO_CMDCTRL</displayName>
  <description>SDIO_CMDCTRL</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000003ff</resetMask>
  <fields>
    <field>
      <name>CMDIDX</name>
      <description>CMDIDX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDRESP</name>
      <description>CMDRESP</description>
      <bitOffset>1</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>WINTREQ</name>
      <description>WINTREQ</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WDATEND</name>
      <description>WDATEND</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CPSMEN</name>
      <description>CPSMEN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SUSPEND</name>
      <description>SUSPEND</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDCOMPLEN</name>
      <description>CMDCOMPLEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INTDIS</name>
      <description>INTDIS</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CEATAEN</name>
      <description>CEATAEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_CMDRESP</name>
  <displayName>SDIO_CMDRESP</displayName>
  <description>SDIO_CMDRESP</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>RESPCMDIDX</name>
      <description>RESPCMDIDX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_RESP1</name>
  <displayName>SDIO_RESP1</displayName>
  <description>SDIO_RESP1</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CARDSTS1</name>
      <description>CARDSTS1</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_RESP2</name>
  <displayName>SDIO_RESP2</displayName>
  <description>SDIO_RESP2</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CARDSTS2</name>
      <description>CARDSTS2</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_RESP3</name>
  <displayName>SDIO_RESP3</displayName>
  <description>SDIO_RESP3</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CARDSTS3</name>
      <description>CARDSTS3</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_RESP4</name>
  <displayName>SDIO_RESP4</displayName>
  <description>SDIO_RESP4</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CARDSTS4</name>
      <description>CARDSTS4</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_DATTIMEOUT</name>
  <displayName>SDIO_DATTIMEOUT</displayName>
  <description>SDIO_DATTIMEOUT</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATTIMEOUT</name>
      <description>DATTIMEOUT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_DATLEN</name>
  <displayName>SDIO_DATLEN</displayName>
  <description>SDIO_DATLEN</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x01ffffff</resetMask>
  <fields>
    <field>
      <name>DATLEN</name>
      <description>DATLEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>25</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_DATCTRL</name>
  <displayName>SDIO_DATCTRL</displayName>
  <description>SDIO_DATCTRL</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00001fff</resetMask>
  <fields>
    <field>
      <name>DATEN</name>
      <description>DATEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATDIR</name>
      <description>DATDIR</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TRANSMOD</name>
      <description>TRANSMOD</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DMAEN</name>
      <description>DMAEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BLKSIZE</name>
      <description>BLKSIZE</description>
      <bitOffset>4</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>RWAITEN</name>
      <description>RWAITEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RWAITSTOP</name>
      <description>RWAITSTOP</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RWAITMOD</name>
      <description>RWAITMOD</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SDIOEN</name>
      <description>SDIOEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DMADIR</name>
      <description>DMADIR</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_DATCOUNT</name>
  <displayName>SDIO_DATCOUNT</displayName>
  <description>SDIO_DATCOUNT</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x01ffffff</resetMask>
  <fields>
    <field>
      <name>DATCOUNT</name>
      <description>DATCOUNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>25</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_STS</name>
  <displayName>SDIO_STS</displayName>
  <description>SDIO_STS</description>
  <addressOffset>0x34</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffffff</resetMask>
  <fields>
    <field>
      <name>CCRCERR</name>
      <description>CCRCERR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DCRCERR</name>
      <description>DCRCERR</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDTIMEOUT</name>
      <description>CMDTIMEOUT</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATTIMEOUT</name>
      <description>DATTIMEOUT</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXURERR</name>
      <description>TXURERR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXORERR</name>
      <description>RXORERR</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDRESPRECV</name>
      <description>CMDRESPRECV</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDSEND</name>
      <description>CMDSEND</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATEND</name>
      <description>DATEND</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SBERR</name>
      <description>SBERR</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATBLKEND</name>
      <description>DATBLKEND</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDRUN</name>
      <description>CMDRUN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXRUN</name>
      <description>TXRUN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXRUN</name>
      <description>RXRUN</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TFIFOHE</name>
      <description>TFIFOHE</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RFIFOHF</name>
      <description>RFIFOHF</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TFIFOF</name>
      <description>TFIFOF</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RFIFOF</name>
      <description>RFIFOF</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TFIFOE</name>
      <description>TFIFOE</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RFIFOE</name>
      <description>RFIFOE</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TDATVALID</name>
      <description>TDATVALID</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RDATVALID</name>
      <description>RDATVALID</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SDIOINT</name>
      <description>SDIOINT</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CEATAF</name>
      <description>CEATAF</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_INTCLR</name>
  <displayName>SDIO_INTCLR</displayName>
  <description>SDIO_INTCLR</description>
  <addressOffset>0x38</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00c007ff</resetMask>
  <fields>
    <field>
      <name>CCRCERRC</name>
      <description>CCRCERRC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DCRCERRC</name>
      <description>DCRCERRC</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDTIMEOUTC</name>
      <description>CMDTIMEOUTC</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATTIMEOUTC</name>
      <description>DATTIMEOUTC</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXURERRC</name>
      <description>TXURERRC</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXORERRC</name>
      <description>RXORERRC</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDRESPRECVC</name>
      <description>CMDRESPRECVC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDSENDC</name>
      <description>CMDSENDC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATENDC</name>
      <description>DATENDC</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SBERRC</name>
      <description>SBERRC</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATBLKENDC</name>
      <description>DATBLKENDC</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SDIOINTC</name>
      <description>SDIOINTC</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CEATAFC</name>
      <description>CEATAFC</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_INTEN</name>
  <displayName>SDIO_INTEN</displayName>
  <description>SDIO_INTEN</description>
  <addressOffset>0x3c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffffff</resetMask>
  <fields>
    <field>
      <name>CCRCERREN</name>
      <description>CCRCERREN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DCRCERREN</name>
      <description>DCRCERREN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDTIMEOUTEN</name>
      <description>CMDTIMEOUTEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATTIMEOUTEN</name>
      <description>DATTIMEOUTEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXURERREN</name>
      <description>TXURERREN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXORERREN</name>
      <description>RXORERREN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDRESPRECVEN</name>
      <description>CMDRESPRECVEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDSENDEN</name>
      <description>CMDSENDEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATENDEN</name>
      <description>DATENDEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SBERREN</name>
      <description>SBERREN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATBLKENDEN</name>
      <description>DATBLKENDEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CMDRUNEN</name>
      <description>CMDRUNEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXRUNEN</name>
      <description>TXRUNEN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXRUNEN</name>
      <description>RXRUNEN</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TFIFOHEEN</name>
      <description>TFIFOHEEN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RFIFOHFEN</name>
      <description>RFIFOHFEN</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TFIFOFEN</name>
      <description>TFIFOFEN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RFIFOFEN</name>
      <description>RFIFOFEN</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TFIFOEEN</name>
      <description>TFIFOEEN</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RFIFOEEN</name>
      <description>RFIFOEEN</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TDATVALIDEN</name>
      <description>TDATVALIDEN</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RDATVALIDEN</name>
      <description>RDATVALIDEN</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SDIOINTEN</name>
      <description>SDIOINTEN</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CEATAFEN</name>
      <description>CEATAFEN</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_FIFOCOUNT</name>
  <displayName>SDIO_FIFOCOUNT</displayName>
  <description>SDIO_FIFOCOUNT</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffffff</resetMask>
  <fields>
    <field>
      <name>FIFOCOUNT</name>
      <description>FIFOCOUNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>24</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SDIO_DATFIFO</name>
  <displayName>SDIO_DATFIFO</displayName>
  <description>SDIO_DATFIFO</description>
  <addressOffset>0x80</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FIFIDAT</name>
      <description>FIFIDAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
